In [1]:
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [9]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
#from sklearn[.something] import [something]

In [27]:
TitanData = pd.DataFrame.from_csv(open('Data/Titanic/train.csv','r'))

#male=0, female=1
TitanData.loc[TitanData['Sex']=='male','Sex'] = 0
TitanData.loc[TitanData['Sex']=='female','Sex'] = 1

In [7]:
TitanData.columns

Index([u'Survived', u'Pclass', u'Name', u'Sex', u'Age', u'SibSp', u'Parch',
       u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

In [4]:
TitanData.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [10]:
TitanData.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [29]:
print TitanData['Sex'].unique()

[0 1]

In [30]:
TitanData['Parch'].unique()

array([0, 1, 2, 5, 3, 4, 6])

In [28]:
#male=0, female=1
TitanData.loc[TitanData['Sex']=='male','Sex'] = 0
TitanData.loc[TitanData['Sex']=='female','Sex'] = 1

print TitanData['Sex'].mean()
print TitanData['Sex'].unique()

0.35241301908
[0 1]

[0 1]